lvx/base/InformationRegisters/бит_ОбъектыМобильногоВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОбъектыМобильногоВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ОбъектыМобильногоВизирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Первоначальное заполнение регистра сведений бит_ОбъектыМобильногоВизирования.
// 
Процедура ЗаполнитьОбъектыМобильногоВизирования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.ОбъектСистемы КАК ОбъектСистемы
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК Таблица";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбъектыВизирования = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектыВизирования);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК ОбъектСистемы,
		|	Таблица.Наименование КАК Синоним
		|ИЗ
		|	Справочник.бит_ОбъектыСистемы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В(&Ссылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		НаборЗаписей = РегистрыСведений.бит_ОбъектыМобильногоВизирования.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Пока Выборка.Следующий() Цикл
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Формирует список полей для подстановки в шаблоны.
// Значение - форматная строка в формате C#, потому что форматирование происходит на стороне мобильного приложения.
// Представление - имя поля. 
// 
Функция СформироватьСписокПолей() Экспорт
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить(""           , "Company");
	СписокПолей.Добавить(""           , "Department");
	СписокПолей.Добавить(""           , "TurnoverItem");
	СписокПолей.Добавить(""           , "Project");
	СписокПолей.Добавить(""           , "Partner");
	СписокПолей.Добавить(""           , "Contract");
	СписокПолей.Добавить("dd.MM.yyy"  , "PaymentDate");
	СписокПолей.Добавить("0.00"       , "Amount");
	СписокПолей.Добавить(""           , "Currency");
	СписокПолей.Добавить(""           , "ManagerialPurpose");
	СписокПолей.Добавить(""           , "OverBudget");
	СписокПолей.Добавить(""           , "ResponsiblePerson");
	СписокПолей.Добавить(""           , "Scenario");
	СписокПолей.Добавить(""           , "Comment");
	СписокПолей.Добавить(""           , "Number");
	СписокПолей.Добавить("dd.MM.yyyy" , "Date");
	
	Возврат СписокПолей;
	
КонецФункции // СформироватьСписокПолей()	

#КонецОбласти

#КонецЕсли
